run/Tests/convAnalysis1D/small/constant/phaseFieldProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseFieldProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

diffuseInterfaceType capillaryInterface;

capillaryInterface
{
     meanFaceViscosity "blended";
}

doubleWellEnergyModel GinzburgLandau;

mixingEnergyModel relaxation;//equilibriumPlanar;

mixingEnergy
{
    corrWidth 0.5;
}

diffuseInterface
{
    Marangoni
    {
        model linear;

        sigmaT              sigmaT [ 1 0 -2 -1 0 0 0 ] 0.00001; 
        T0                  T0 [ 0 0 0 1 0 0 0 ] 273.1;  
    }

    //- diffusion interface model
    type    CahnHilliard;
/*    type    AllenCahn;*/

    AllenCahn
    {
        nMaxIter 1;
    }

    CahnHilliard
    {
        //- numerical method
        method  segregated;
/*        method  coupled;*/

        coupled
        {
            linearisationMethod stable;
            beta    1.0;
        }
    }

    //- capillary width
    epsilon                 epsilon [ 0 1 0 0 0 0 0 ] 1e-5;

    //- interfacial mobility
    mobility
    {
        kappa               kappa [ -1 3 1 0 0 0 0 ] 5e-11;

        scalingLaw constant;

        YueCoeffs
        {
            mobilityParameter       0.02;
        }
    }

}

// ************************************************************************* //
