run/Tests/convAnalysis1D/small/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    top
    {
        type            patch;
        nFaces          20;
        startFace       19;
    }
    bottom
    {
        type            patch;
        nFaces          20;
        startFace       39;
    }
    left
    {
        type            patch;
        nFaces          1;
        startFace       59;
    }
    right
    {
        type            patch;
        nFaces          1;
        startFace       60;
    }
    frontAndBack
    {
        type            patch;
        nFaces          40;
        startFace       61;
    }
)


// ************************************************************************* //
